<template>
    <div class="fund-table-container">
        <div class="radio-group-wrapper">
            <a-radio-group v-model:value="fundType" @change="handleRadioChange" style="margin-bottom: 16px">
                <a-radio-button value="all">所有</a-radio-button>
                <a-radio-button value="etf">ETF</a-radio-button>
                <a-radio-button value="industry">行业</a-radio-button>
            </a-radio-group>
        </div>
        <template v-if="fundType === 'all' || fundType === 'etf'">
            <a-space :size="[0, 8]" wrap style="margin: 10px 0">
                <a-checkable-tag v-for="date in dates" :key="date" :checked="selectedDate === date"
                    @change="checked => handleDateChange(date, checked)">
                    {{ date }}
                </a-checkable-tag>
            </a-space>
            <a-table :columns="columns" :data-source="tableData" @change="handleTableChange"
                :pagination="{ pageSize: 20 }" :scroll="{ x: 1300 }">
                <template #bodyCell="{ column, record }">
                    <template v-if="column.dataIndex === 'F003N_FUND33' ||
                        column.dataIndex === 'F008' ||
                        column.dataIndex === 'F009' ||
                        column.dataIndex === 'F010' ||
                        column.dataIndex === 'F011'">
                        <div style="display: flex; align-items: center; gap: 8px">
                            <span>{{ record[column.dataIndex] }}%</span>
                            <a-tag color="green">
                                {{ record[`${column.dataIndex}_index`] === 1 ? '🏆 1' :
                                    record[`${column.dataIndex}_index`] === 2 ? '🥈 2' :
                                        record[`${column.dataIndex}_index`] === 3 ? '🥉 3' :
                                            record[`${column.dataIndex}_index`] }}
                            </a-tag>
                        </div>
                    </template>
                </template>
            </a-table>
        </template>
        <template v-else>
            <IndustryList />
        </template>
    </div>
</template>

<script setup>
import { ref, h, onMounted, reactive } from 'vue';

const columns = ref([
    {
        title: '基金名称',
        dataIndex: 'name',
        width: 200,
        fixed: 'left',
        customRender: ({ text, record }) => {
            return h(
                'a',
                {
                    href: `https://fund.10jqka.com.cn/${record.code}/`,
                    target: '_blank',
                    class: 'fund-link'
                },
                text
            );
        }
    },
    {
        title: '最新净值',
        dataIndex: 'newnet',
        width: 100,
        sorter: true,
        customRender: ({ text, record }) => {
            return h(
                'span',
                {
                    style: {
                        color: parseFloat(record.prerate) >= 0 ? '#f5222d' : '#52c41a'
                    }
                },
                text
            );
        }
    },
    {
        title: '周收益率',
        dataIndex: 'F003N_FUND33',
        width: 100,
        sorter: true,
        sortDirections: ['descend', 'ascend', null]
    },
    {
        title: '月收益率',
        dataIndex: 'F008',
        width: 100,
        defaultSortOrder: 'descend',
        sorter: true,
        render: (text) => `${text}%`,
        sortDirections: ['descend', 'ascend', null]
    },
    {
        title: '季收益率',
        dataIndex: 'F009',
        width: 100,
        sorter: true,
        render: (text) => `${text}%`,
        sortDirections: ['descend', 'ascend', null]
    },
    {
        title: '综合排名',
        dataIndex: 'ranking',
        width: 100
    },
    {
        title: '基金公司',
        dataIndex: 'orgname',
        width: 200,
    },
    {
        title: '成立日期',
        dataIndex: 'clrq',
        width: 120,
    },
    {
        title: '申购状态',
        dataIndex: 'sgstat',
        width: 100,
    },
    {
        title: '赎回状态',
        dataIndex: 'shstat',
        width: 100,
    },
]);

const fundsArray = [
    {
        "code": "019457",
        "typename": "股票型",
        "net": "1.6315",
        "name": "平安先进制造主题股票发起A",
        "newnet": "1.6315",
        "newdate": "2025-02-20",
        "net1": "1.5985",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2023-10-24",
        "orgid": "T000035604",
        "orgname": "平安基金管理有限公司",
        "prerate": "2.06",
        "F003N_FUND33": "13.63",
        "F005": "54.28",
        "F008": "32.21",
        "F009": "51.50",
        "F010": "117.85",
        "F011": "99.40",
        "F012": "63.15",
        "F014N_FUND33": "63.15",
        "F015N_FUND33": "63.15"
    },
    {
        "code": "019458",
        "typename": "股票型",
        "net": "1.6188",
        "name": "平安先进制造主题股票发起C",
        "newnet": "1.6188",
        "newdate": "2025-02-20",
        "net1": "1.5861",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2023-10-24",
        "orgid": "T000035604",
        "orgname": "平安基金管理有限公司",
        "prerate": "2.06",
        "F003N_FUND33": "13.62",
        "F005": "54.16",
        "F008": "32.16",
        "F009": "51.26",
        "F010": "117.20",
        "F011": "98.24",
        "F012": "61.88",
        "F014N_FUND33": "61.88",
        "F015N_FUND33": "61.88"
    },
    {
        "code": "018124",
        "typename": "混合型",
        "net": "2.0509",
        "name": "永赢先进制造智选混合发起A",
        "newnet": "2.0509",
        "newdate": "2025-02-20",
        "net1": "2.0054",
        "shstat": "开放",
        "sgstat": "限制大额",
        "clrq": "2023-05-04",
        "orgid": "T000137360",
        "orgname": "永赢基金管理有限公司",
        "prerate": "2.27",
        "F003N_FUND33": "13.61",
        "F005": "62.15",
        "F008": "31.84",
        "F009": "78.08",
        "F010": "170.60",
        "F011": "125.94",
        "F012": "105.09",
        "F014N_FUND33": "105.09",
        "F015N_FUND33": "105.09"
    },
    {
        "code": "018125",
        "typename": "混合型",
        "net": "2.0367",
        "name": "永赢先进制造智选混合发起C",
        "newnet": "2.0367",
        "newdate": "2025-02-20",
        "net1": "1.9916",
        "shstat": "开放",
        "sgstat": "限制大额",
        "clrq": "2023-05-04",
        "orgid": "T000137360",
        "orgname": "永赢基金管理有限公司",
        "prerate": "2.26",
        "F003N_FUND33": "13.60",
        "F005": "62.05",
        "F008": "31.79",
        "F009": "77.89",
        "F010": "170.05",
        "F011": "125.02",
        "F012": "103.67",
        "F014N_FUND33": "103.67",
        "F015N_FUND33": "103.67"
    },
    {
        "code": "016530",
        "typename": "混合型",
        "net": "1.6450",
        "name": "鹏华碳中和主题混合A",
        "newnet": "1.6450",
        "newdate": "2025-02-20",
        "net1": "1.6052",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2023-05-05",
        "orgid": "T000009584",
        "orgname": "鹏华基金管理有限公司",
        "prerate": "2.48",
        "F003N_FUND33": "13.28",
        "F005": "65.79",
        "F008": "31.24",
        "F009": "73.74",
        "F010": "141.52",
        "F011": "120.24",
        "F012": "64.50",
        "F014N_FUND33": "64.50",
        "F015N_FUND33": "64.50"
    },
    {
        "code": "016531",
        "typename": "混合型",
        "net": "1.6274",
        "name": "鹏华碳中和主题混合C",
        "newnet": "1.6274",
        "newdate": "2025-02-20",
        "net1": "1.5880",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2023-05-05",
        "orgid": "T000009584",
        "orgname": "鹏华基金管理有限公司",
        "prerate": "2.48",
        "F003N_FUND33": "13.27",
        "F005": "65.66",
        "F008": "31.19",
        "F009": "73.48",
        "F010": "140.85",
        "F011": "118.94",
        "F012": "62.74",
        "F014N_FUND33": "62.74",
        "F015N_FUND33": "62.74"
    },
    {
        "code": "001765",
        "typename": "混合型",
        "net": "1.8990",
        "name": "前海开源嘉鑫混合A",
        "newnet": "1.8990",
        "newdate": "2025-02-20",
        "net1": "1.8460",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2016-12-26",
        "orgid": "T000120522",
        "orgname": "前海开源基金管理有限公司",
        "prerate": "2.87",
        "F003N_FUND33": "14.19",
        "F005": "52.53",
        "F008": "30.61",
        "F009": "51.31",
        "F010": "58.51",
        "F011": "60.25",
        "F012": "137.46",
        "F014N_FUND33": "52.41",
        "F015N_FUND33": "55.90"
    },
    {
        "code": "001770",
        "typename": "混合型",
        "net": "1.8780",
        "name": "前海开源嘉鑫混合C",
        "newnet": "1.8780",
        "newdate": "2025-02-20",
        "net1": "1.8250",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2016-12-26",
        "orgid": "T000120522",
        "orgname": "前海开源基金管理有限公司",
        "prerate": "2.90",
        "F003N_FUND33": "14.23",
        "F005": "52.44",
        "F008": "30.60",
        "F009": "51.21",
        "F010": "58.48",
        "F011": "60.10",
        "F012": "134.61",
        "F014N_FUND33": "51.82",
        "F015N_FUND33": "55.19"
    },
    {
        "code": "021489",
        "typename": "混合型",
        "net": "2.1426",
        "name": "中航趋势领航混合发起A",
        "newnet": "2.1426",
        "newdate": "2025-02-20",
        "net1": "2.1166",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2024-06-18",
        "orgid": "T000383548",
        "orgname": "中航基金管理有限公司",
        "prerate": "1.23",
        "F003N_FUND33": "13.81",
        "F005": "53.72",
        "F008": "30.46",
        "F009": "65.53",
        "F010": "131.30",
        "F011": "120.40",
        "F012": "120.40",
        "F014N_FUND33": "120.40",
        "F015N_FUND33": "120.40"
    },
    {
        "code": "021490",
        "typename": "混合型",
        "net": "2.1335",
        "name": "中航趋势领航混合发起C",
        "newnet": "2.1335",
        "newdate": "2025-02-20",
        "net1": "2.1076",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2024-06-18",
        "orgid": "T000383548",
        "orgname": "中航基金管理有限公司",
        "prerate": "1.23",
        "F003N_FUND33": "13.79",
        "F005": "53.60",
        "F008": "30.39",
        "F009": "65.29",
        "F010": "130.60",
        "F011": "119.49",
        "F012": "119.49",
        "F014N_FUND33": "119.49",
        "F015N_FUND33": "119.49"
    },
    {
        "code": "007518",
        "typename": "混合型",
        "net": "0.9368",
        "name": "东方阿尔法优选混合A",
        "newnet": "0.9368",
        "newdate": "2025-02-20",
        "net1": "0.9189",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2019-09-12",
        "orgid": "T004747360",
        "orgname": "东方阿尔法基金管理有限公司",
        "prerate": "1.95",
        "F003N_FUND33": "12.33",
        "F005": "31.19",
        "F008": "29.75",
        "F009": "27.61",
        "F010": "63.21",
        "F011": "48.18",
        "F012": "-6.33",
        "F014N_FUND33": "-3.94",
        "F015N_FUND33": "-22.64"
    },
    {
        "code": "007519",
        "typename": "混合型",
        "net": "0.9116",
        "name": "东方阿尔法优选混合C",
        "newnet": "0.9116",
        "newdate": "2025-02-20",
        "net1": "0.8942",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2019-09-12",
        "orgid": "T004747360",
        "orgname": "东方阿尔法基金管理有限公司",
        "prerate": "1.95",
        "F003N_FUND33": "12.32",
        "F005": "31.09",
        "F008": "29.71",
        "F009": "27.46",
        "F010": "62.81",
        "F011": "47.44",
        "F012": "-8.85",
        "F014N_FUND33": "-4.89",
        "F015N_FUND33": "-23.80"
    },
    {
        "code": "007713",
        "typename": "混合型",
        "net": "1.3497",
        "name": "华富科技动能混合A",
        "newnet": "1.3497",
        "newdate": "2025-02-20",
        "net1": "1.3255",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2019-11-06",
        "orgid": "00089251",
        "orgname": "华富基金管理有限公司",
        "prerate": "1.83",
        "F003N_FUND33": "10.40",
        "F005": "44.63",
        "F008": "27.76",
        "F009": "50.49",
        "F010": "117.55",
        "F011": "97.64",
        "F012": "40.45",
        "F014N_FUND33": "17.47",
        "F015N_FUND33": "6.38"
    },
    {
        "code": "017968",
        "typename": "混合型",
        "net": "1.3341",
        "name": "华富科技动能混合C",
        "newnet": "1.3341",
        "newdate": "2025-02-20",
        "net1": "1.3102",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2023-03-09",
        "orgid": "00089251",
        "orgname": "华富基金管理有限公司",
        "prerate": "1.82",
        "F003N_FUND33": "10.37",
        "F005": "44.49",
        "F008": "27.69",
        "F009": "50.25",
        "F010": "116.89",
        "F011": "96.45",
        "F012": "21.12",
        "F014N_FUND33": "21.12",
        "F015N_FUND33": "21.12"
    },
    {
        "code": "005541",
        "typename": "混合型",
        "net": "1.5879",
        "name": "前海开源盛鑫混合A",
        "newnet": "1.5879",
        "newdate": "2025-02-20",
        "net1": "1.5500",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2018-04-04",
        "orgid": "T000120522",
        "orgname": "前海开源基金管理有限公司",
        "prerate": "2.45",
        "F003N_FUND33": "12.01",
        "F005": "50.37",
        "F008": "26.32",
        "F009": "49.72",
        "F010": "46.39",
        "F011": "55.19",
        "F012": "192.80",
        "F014N_FUND33": "23.37",
        "F015N_FUND33": "15.89"
    },
    {
        "code": "005542",
        "typename": "混合型",
        "net": "1.5950",
        "name": "前海开源盛鑫混合C",
        "newnet": "1.5950",
        "newdate": "2025-02-20",
        "net1": "1.5569",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2018-04-04",
        "orgid": "T000120522",
        "orgname": "前海开源基金管理有限公司",
        "prerate": "2.45",
        "F003N_FUND33": "12.02",
        "F005": "50.39",
        "F008": "26.32",
        "F009": "49.71",
        "F010": "46.36",
        "F011": "55.10",
        "F012": "191.31",
        "F014N_FUND33": "23.22",
        "F015N_FUND33": "15.64"
    },
    {
        "code": "006689",
        "typename": "混合型",
        "net": "0.7992",
        "name": "方正富邦信泓混合A",
        "newnet": "0.7992",
        "newdate": "2025-02-20",
        "net1": "0.7793",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2019-07-26",
        "orgid": "T000056118",
        "orgname": "方正富邦基金管理有限公司",
        "prerate": "2.55",
        "F003N_FUND33": "12.37",
        "F005": "35.07",
        "F008": "25.62",
        "F009": "35.83",
        "F010": "40.93",
        "F011": "37.77",
        "F012": "-20.08",
        "F014N_FUND33": "-3.75",
        "F015N_FUND33": "-26.93"
    },
    {
        "code": "008182",
        "typename": "混合型",
        "net": "0.7705",
        "name": "方正富邦信泓混合C",
        "newnet": "0.7705",
        "newdate": "2025-02-20",
        "net1": "0.7514",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2019-11-05",
        "orgid": "T000056118",
        "orgname": "方正富邦基金管理有限公司",
        "prerate": "2.54",
        "F003N_FUND33": "12.37",
        "F005": "35.01",
        "F008": "25.61",
        "F009": "35.72",
        "F010": "40.73",
        "F011": "37.34",
        "F012": "-22.94",
        "F014N_FUND33": "-4.35",
        "F015N_FUND33": "-27.65"
    },
    {
        "code": "017048",
        "typename": "混合型",
        "net": "0.7764",
        "name": "富安达产业优选混合A",
        "newnet": "0.7764",
        "newdate": "2025-02-20",
        "net1": "0.7535",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2023-03-01",
        "orgid": "T000045194",
        "orgname": "富安达基金管理有限公司",
        "prerate": "3.04",
        "F003N_FUND33": "13.44",
        "F005": "39.36",
        "F008": "25.33",
        "F009": "24.14",
        "F010": "37.27",
        "F011": "20.67",
        "F012": "-22.36",
        "F014N_FUND33": "-22.36",
        "F015N_FUND33": "-22.36"
    },
    {
        "code": "017049",
        "typename": "混合型",
        "net": "0.7686",
        "name": "富安达产业优选混合C",
        "newnet": "0.7686",
        "newdate": "2025-02-20",
        "net1": "0.7460",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2023-03-01",
        "orgid": "T000045194",
        "orgname": "富安达基金管理有限公司",
        "prerate": "3.03",
        "F003N_FUND33": "13.43",
        "F005": "39.26",
        "F008": "25.28",
        "F009": "23.99",
        "F010": "36.93",
        "F011": "20.06",
        "F012": "-23.14",
        "F014N_FUND33": "-23.14",
        "F015N_FUND33": "-23.14"
    },
    {
        "code": "021985",
        "typename": "混合型",
        "net": "1.3134",
        "name": "财通资管先进制造混合发起式A",
        "newnet": "1.3134",
        "newdate": "2025-02-20",
        "net1": "1.2952",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2024-10-15",
        "orgid": "T000186525",
        "orgname": "财通证券资产管理有限公司",
        "prerate": "1.41",
        "F003N_FUND33": "10.18",
        "F005": "30.69",
        "F008": "25.24",
        "F009": "26.70",
        "F010": "31.34",
        "F011": "31.34",
        "F012": "31.34",
        "F014N_FUND33": "31.34",
        "F015N_FUND33": "31.34"
    },
    {
        "code": "021986",
        "typename": "混合型",
        "net": "1.3114",
        "name": "财通资管先进制造混合发起式C",
        "newnet": "1.3114",
        "newdate": "2025-02-20",
        "net1": "1.2932",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2024-10-15",
        "orgid": "T000186525",
        "orgname": "财通证券资产管理有限公司",
        "prerate": "1.41",
        "F003N_FUND33": "10.16",
        "F005": "30.62",
        "F008": "25.21",
        "F009": "26.57",
        "F010": "31.14",
        "F011": "31.14",
        "F012": "31.14",
        "F014N_FUND33": "31.14",
        "F015N_FUND33": "31.14"
    },
    {
        "code": "000649",
        "typename": "混合型",
        "net": "1.9120",
        "name": "长城久鑫混合A",
        "newnet": "1.9120",
        "newdate": "2025-02-20",
        "net1": "1.8725",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2014-07-30",
        "orgid": "T000009642",
        "orgname": "长城基金管理有限公司",
        "prerate": "2.11",
        "F003N_FUND33": "10.11",
        "F005": "42.47",
        "F008": "24.62",
        "F009": "43.72",
        "F010": "67.82",
        "F011": "53.95",
        "F012": "134.07",
        "F014N_FUND33": "7.59",
        "F015N_FUND33": "-1.50"
    },
    {
        "code": "017461",
        "typename": "混合型",
        "net": "1.8866",
        "name": "长城久鑫混合C",
        "newnet": "1.8866",
        "newdate": "2025-02-20",
        "net1": "1.8476",
        "shstat": "",
        "sgstat": "",
        "clrq": "2022-11-30",
        "orgid": "T000009642",
        "orgname": "长城基金管理有限公司",
        "prerate": "2.11",
        "F003N_FUND33": "10.10",
        "F005": "42.37",
        "F008": "24.56",
        "F009": "43.51",
        "F010": "67.34",
        "F011": "53.05",
        "F012": "17.95",
        "F014N_FUND33": "6.32",
        "F015N_FUND33": "17.95"
    },
    {
        "code": "013250",
        "typename": "混合型",
        "net": "0.6967",
        "name": "红土创新智能制造混合型发起式A",
        "newnet": "0.6967",
        "newdate": "2025-02-20",
        "net1": "0.6908",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2021-09-08",
        "orgid": "T000152420",
        "orgname": "红土创新基金管理有限公司",
        "prerate": "0.85",
        "F003N_FUND33": "10.66",
        "F005": "30.98",
        "F008": "23.35",
        "F009": "28.31",
        "F010": "55.17",
        "F011": "40.58",
        "F012": "-30.33",
        "F014N_FUND33": "-19.40",
        "F015N_FUND33": "-20.43"
    },
    {
        "code": "021957",
        "typename": "混合型",
        "net": "0.6810",
        "name": "红土创新智能制造混合型发起式C",
        "newnet": "0.6810",
        "newdate": "2025-02-20",
        "net1": "0.6753",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2024-08-07",
        "orgid": "T000152420",
        "orgname": "红土创新基金管理有限公司",
        "prerate": "0.84",
        "F003N_FUND33": "10.64",
        "F005": "30.81",
        "F008": "23.21",
        "F009": "28.06",
        "F010": "51.70",
        "F011": "48.17",
        "F012": "48.17",
        "F014N_FUND33": "48.17",
        "F015N_FUND33": "48.17"
    },
    {
        "code": "006477",
        "typename": "混合型",
        "net": "1.1299",
        "name": "中邮沪港深精选混合A",
        "newnet": "1.1299",
        "newdate": "2025-02-20",
        "net1": "1.1518",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2019-03-28",
        "orgid": "00216478",
        "orgname": "中邮创业基金管理股份有限公司",
        "prerate": "-1.90",
        "F003N_FUND33": "7.70",
        "F005": "24.77",
        "F008": "22.90",
        "F009": "27.17",
        "F010": "66.92",
        "F011": "80.12",
        "F012": "12.99",
        "F014N_FUND33": "28.62",
        "F015N_FUND33": "16.35"
    },
    {
        "code": "023176",
        "typename": "混合型",
        "net": "1.1271",
        "name": "中邮沪港深精选混合C",
        "newnet": "1.1271",
        "newdate": "2025-02-20",
        "net1": "1.1489",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2025-01-14",
        "orgid": "00216478",
        "orgname": "中邮创业基金管理股份有限公司",
        "prerate": "-1.90",
        "F003N_FUND33": "7.70",
        "F005": "27.75",
        "F008": "22.58",
        "F009": "27.75",
        "F010": "27.75",
        "F011": "27.75",
        "F012": "27.75",
        "F014N_FUND33": "27.75",
        "F015N_FUND33": "27.75"
    },
    {
        "code": "008997",
        "typename": "混合型",
        "net": "1.0929",
        "name": "同泰竞争优势混合A",
        "newnet": "1.0929",
        "newdate": "2025-02-20",
        "net1": "1.0700",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2020-04-27",
        "orgid": "T004886491",
        "orgname": "同泰基金管理有限公司",
        "prerate": "2.14",
        "F003N_FUND33": "9.85",
        "F005": "34.98",
        "F008": "22.56",
        "F009": "22.94",
        "F010": "49.22",
        "F011": "55.09",
        "F012": "9.29",
        "F014N_FUND33": "13.25",
        "F015N_FUND33": "-1.25"
    },
    {
        "code": "008998",
        "typename": "混合型",
        "net": "1.0721",
        "name": "同泰竞争优势混合C",
        "newnet": "1.0721",
        "newdate": "2025-02-20",
        "net1": "1.0497",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2020-04-27",
        "orgid": "T004886491",
        "orgname": "同泰基金管理有限公司",
        "prerate": "2.13",
        "F003N_FUND33": "9.84",
        "F005": "34.89",
        "F008": "22.53",
        "F009": "22.82",
        "F010": "48.92",
        "F011": "54.46",
        "F012": "7.21",
        "F014N_FUND33": "12.34",
        "F015N_FUND33": "-2.43"
    },
    {
        "code": "019864",
        "typename": "混合型",
        "net": "1.8481",
        "name": "浦银安盛高端装备混合A",
        "newnet": "1.8481",
        "newdate": "2025-02-20",
        "net1": "1.8372",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2024-03-28",
        "orgid": "03143791",
        "orgname": "浦银安盛基金管理有限公司",
        "prerate": "0.59",
        "F003N_FUND33": "8.79",
        "F005": "37.80",
        "F008": "21.73",
        "F009": "44.20",
        "F010": "99.56",
        "F011": "84.81",
        "F012": "84.81",
        "F014N_FUND33": "84.81",
        "F015N_FUND33": "84.81"
    },
    {
        "code": "019865",
        "typename": "混合型",
        "net": "1.8344",
        "name": "浦银安盛高端装备混合C",
        "newnet": "1.8344",
        "newdate": "2025-02-20",
        "net1": "1.8235",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2024-03-28",
        "orgid": "03143791",
        "orgname": "浦银安盛基金管理有限公司",
        "prerate": "0.60",
        "F003N_FUND33": "8.79",
        "F005": "37.73",
        "F008": "21.68",
        "F009": "44.06",
        "F010": "98.40",
        "F011": "83.44",
        "F012": "83.44",
        "F014N_FUND33": "83.44",
        "F015N_FUND33": "83.44"
    },
    {
        "code": "001864",
        "typename": "混合型",
        "net": "3.2290",
        "name": "中海魅力长三角混合",
        "newnet": "3.2290",
        "newdate": "2025-02-20",
        "net1": "3.1850",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2016-03-30",
        "orgid": "T000025305",
        "orgname": "中海基金管理有限公司",
        "prerate": "1.38",
        "F003N_FUND33": "9.35",
        "F005": "35.33",
        "F008": "21.57",
        "F009": "28.85",
        "F010": "72.77",
        "F011": "59.85",
        "F012": "222.90",
        "F014N_FUND33": "31.10",
        "F015N_FUND33": "21.16"
    },
    {
        "code": "008640",
        "typename": "混合型",
        "net": "1.6003",
        "name": "方正富邦科技创新A",
        "newnet": "1.6003",
        "newdate": "2025-02-20",
        "net1": "1.5696",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2020-01-21",
        "orgid": "T000056118",
        "orgname": "方正富邦基金管理有限公司",
        "prerate": "1.96",
        "F003N_FUND33": "10.38",
        "F005": "30.90",
        "F008": "20.61",
        "F009": "25.10",
        "F010": "49.35",
        "F011": "41.24",
        "F012": "60.03",
        "F014N_FUND33": "-6.68",
        "F015N_FUND33": "-24.91"
    },
    {
        "code": "008641",
        "typename": "混合型",
        "net": "1.5766",
        "name": "方正富邦科技创新C",
        "newnet": "1.5766",
        "newdate": "2025-02-20",
        "net1": "1.5464",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2020-01-21",
        "orgid": "T000056118",
        "orgname": "方正富邦基金管理有限公司",
        "prerate": "1.95",
        "F003N_FUND33": "10.38",
        "F005": "30.85",
        "F008": "20.58",
        "F009": "25.01",
        "F010": "49.12",
        "F011": "40.82",
        "F012": "57.66",
        "F014N_FUND33": "-7.24",
        "F015N_FUND33": "-25.58"
    },
    {
        "code": "007132",
        "typename": "混合型",
        "net": "1.0599",
        "name": "长城港股通价值精选混合A",
        "newnet": "1.0599",
        "newdate": "2025-02-20",
        "net1": "1.0883",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2019-06-26",
        "orgid": "T000009642",
        "orgname": "长城基金管理有限公司",
        "prerate": "-2.61",
        "F003N_FUND33": "6.82",
        "F005": "22.01",
        "F008": "20.43",
        "F009": "26.43",
        "F010": "54.66",
        "F011": "64.89",
        "F012": "8.02",
        "F014N_FUND33": "20.97",
        "F015N_FUND33": "-7.52"
    },
    {
        "code": "017627",
        "typename": "混合型",
        "net": "1.0454",
        "name": "长城港股通价值精选混合C",
        "newnet": "1.0454",
        "newdate": "2025-02-20",
        "net1": "1.0734",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2023-01-18",
        "orgid": "T000009642",
        "orgname": "长城基金管理有限公司",
        "prerate": "-2.61",
        "F003N_FUND33": "6.80",
        "F005": "21.78",
        "F008": "20.24",
        "F009": "26.13",
        "F010": "53.64",
        "F011": "63.39",
        "F012": "18.15",
        "F014N_FUND33": "19.34",
        "F015N_FUND33": "18.15"
    },
    {
        "code": "159770",
        "typename": "股票型",
        "net": "1.0051",
        "name": "机器人ETF",
        "newnet": "1.0051",
        "newdate": "2025-02-20",
        "net1": "0.9887",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2021-10-26",
        "orgid": "00089255",
        "orgname": "天弘基金管理有限公司",
        "prerate": "1.66",
        "F003N_FUND33": "8.97",
        "F005": "25.01",
        "F008": "20.23",
        "F009": "22.81",
        "F010": "77.14",
        "F011": "52.26",
        "F012": "0.51",
        "F014N_FUND33": "21.26",
        "F015N_FUND33": "13.72"
    },
    {
        "code": "562500",
        "typename": "股票型",
        "net": "0.9712",
        "name": "华夏中证机器人ETF",
        "newnet": "0.9712",
        "newdate": "2025-02-20",
        "net1": "0.9552",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2021-12-17",
        "orgid": "00079099",
        "orgname": "华夏基金管理有限公司",
        "prerate": "1.68",
        "F003N_FUND33": "8.99",
        "F005": "24.98",
        "F008": "20.23",
        "F009": "22.50",
        "F010": "75.78",
        "F011": "50.57",
        "F012": "-2.90",
        "F014N_FUND33": "19.66",
        "F015N_FUND33": "12.34"
    },
    {
        "code": "003835",
        "typename": "混合型",
        "net": "1.5826",
        "name": "鹏华沪深港新兴成长混合A",
        "newnet": "1.5826",
        "newdate": "2025-02-20",
        "net1": "1.5593",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2016-12-02",
        "orgid": "T000009584",
        "orgname": "鹏华基金管理有限公司",
        "prerate": "1.49",
        "F003N_FUND33": "10.09",
        "F005": "36.80",
        "F008": "19.88",
        "F009": "29.55",
        "F010": "76.89",
        "F011": "60.51",
        "F012": "94.36",
        "F014N_FUND33": "2.63",
        "F015N_FUND33": "-2.92"
    },
    {
        "code": "018710",
        "typename": "混合型",
        "net": "1.1641",
        "name": "鹏华沪深港新兴成长混合C",
        "newnet": "1.1641",
        "newdate": "2025-02-20",
        "net1": "1.1470",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2023-06-27",
        "orgid": "T000009584",
        "orgname": "鹏华基金管理有限公司",
        "prerate": "1.49",
        "F003N_FUND33": "10.08",
        "F005": "36.73",
        "F008": "19.84",
        "F009": "29.42",
        "F010": "76.57",
        "F011": "59.90",
        "F012": "16.41",
        "F014N_FUND33": "16.41",
        "F015N_FUND33": "16.41"
    },
    {
        "code": "020255",
        "typename": "股票型",
        "net": "1.4827",
        "name": "中欧中证机器人指数发起A",
        "newnet": "1.4827",
        "newdate": "2025-02-20",
        "net1": "1.4599",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2024-01-17",
        "orgid": "03133598",
        "orgname": "中欧基金管理有限公司",
        "prerate": "1.56",
        "F003N_FUND33": "8.43",
        "F005": "23.86",
        "F008": "19.04",
        "F009": "22.51",
        "F010": "71.27",
        "F011": "47.94",
        "F012": "48.27",
        "F014N_FUND33": "48.27",
        "F015N_FUND33": "48.27"
    },
    {
        "code": "019347",
        "typename": "混合型",
        "net": "1.4968",
        "name": "富国匠心成长混合A",
        "newnet": "1.4968",
        "newdate": "2025-02-20",
        "net1": "1.4716",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2024-04-30",
        "orgid": "00022444",
        "orgname": "富国基金管理有限公司",
        "prerate": "1.71",
        "F003N_FUND33": "7.71",
        "F005": "28.83",
        "F008": "18.70",
        "F009": "30.94",
        "F010": "62.11",
        "F011": "49.68",
        "F012": "49.68",
        "F014N_FUND33": "49.68",
        "F015N_FUND33": "49.68"
    },
    {
        "code": "019348",
        "typename": "混合型",
        "net": "1.4903",
        "name": "富国匠心成长混合C",
        "newnet": "1.4903",
        "newdate": "2025-02-20",
        "net1": "1.4652",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2024-04-30",
        "orgid": "00022444",
        "orgname": "富国基金管理有限公司",
        "prerate": "1.71",
        "F003N_FUND33": "7.70",
        "F005": "28.56",
        "F008": "18.49",
        "F009": "30.59",
        "F010": "61.73",
        "F011": "49.03",
        "F012": "49.03",
        "F014N_FUND33": "49.03",
        "F015N_FUND33": "49.03"
    },
    {
        "code": "009092",
        "typename": "混合型",
        "net": "1.7583",
        "name": "富国新材料新能源混合A",
        "newnet": "1.7583",
        "newdate": "2025-02-20",
        "net1": "1.7245",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2020-06-24",
        "orgid": "00022444",
        "orgname": "富国基金管理有限公司",
        "prerate": "1.96",
        "F003N_FUND33": "8.45",
        "F005": "37.01",
        "F008": "18.39",
        "F009": "35.12",
        "F010": "84.71",
        "F011": "68.99",
        "F012": "75.83",
        "F014N_FUND33": "23.14",
        "F015N_FUND33": "24.55"
    },
    {
        "code": "014243",
        "typename": "混合型",
        "net": "1.7252",
        "name": "富国新材料新能源混合C",
        "newnet": "1.7252",
        "newdate": "2025-02-20",
        "net1": "1.6921",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2021-12-09",
        "orgid": "00022444",
        "orgname": "富国基金管理有限公司",
        "prerate": "1.96",
        "F003N_FUND33": "8.43",
        "F005": "36.89",
        "F008": "18.32",
        "F009": "34.91",
        "F010": "84.14",
        "F011": "67.97",
        "F012": "4.30",
        "F014N_FUND33": "21.66",
        "F015N_FUND33": "22.33"
    },
    {
        "code": "501081",
        "typename": "混合型",
        "net": "2.1967",
        "name": "中欧科创主题混合(LOF)A",
        "newnet": "2.1967",
        "newdate": "2025-02-20",
        "net1": "2.1883",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2019-06-28",
        "orgid": "03133598",
        "orgname": "中欧基金管理有限公司",
        "prerate": "0.38",
        "F003N_FUND33": "6.37",
        "F005": "22.59",
        "F008": "17.96",
        "F009": "29.92",
        "F010": "75.88",
        "F011": "82.72",
        "F012": "119.67",
        "F014N_FUND33": "31.57",
        "F015N_FUND33": "20.09"
    },
    {
        "code": "017290",
        "typename": "混合型",
        "net": "2.1698",
        "name": "中欧科创主题混合(LOF)C",
        "newnet": "2.1698",
        "newdate": "2025-02-20",
        "net1": "2.1616",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2022-11-22",
        "orgid": "03133598",
        "orgname": "中欧基金管理有限公司",
        "prerate": "0.38",
        "F003N_FUND33": "6.36",
        "F005": "22.51",
        "F008": "17.92",
        "F009": "29.77",
        "F010": "75.25",
        "F011": "81.60",
        "F012": "32.33",
        "F014N_FUND33": "30.11",
        "F015N_FUND33": "32.33"
    },
    {
        "code": "018240",
        "typename": "股票型",
        "net": "1.3221",
        "name": "嘉实制造升级股票发起式A",
        "newnet": "1.3221",
        "newdate": "2025-02-20",
        "net1": "1.3042",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2023-07-25",
        "orgid": "00000015",
        "orgname": "嘉实基金管理有限公司",
        "prerate": "1.37",
        "F003N_FUND33": "8.57",
        "F005": "27.15",
        "F008": "16.39",
        "F009": "33.24",
        "F010": "80.39",
        "F011": "68.08",
        "F012": "32.21",
        "F014N_FUND33": "32.21",
        "F015N_FUND33": "32.21"
    },
    {
        "code": "018241",
        "typename": "股票型",
        "net": "1.3143",
        "name": "嘉实制造升级股票发起式C",
        "newnet": "1.3143",
        "newdate": "2025-02-20",
        "net1": "1.2965",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2023-07-25",
        "orgid": "00000015",
        "orgname": "嘉实基金管理有限公司",
        "prerate": "1.37",
        "F003N_FUND33": "8.57",
        "F005": "27.12",
        "F008": "16.39",
        "F009": "33.16",
        "F010": "80.12",
        "F011": "67.47",
        "F012": "31.43",
        "F014N_FUND33": "31.43",
        "F015N_FUND33": "31.43"
    },
    {
        "code": "016075",
        "typename": "混合型",
        "net": "0.9626",
        "name": "华夏智造升级混合A",
        "newnet": "0.9626",
        "newdate": "2025-02-20",
        "net1": "0.9545",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2022-11-18",
        "orgid": "00079099",
        "orgname": "华夏基金管理有限公司",
        "prerate": "0.85",
        "F003N_FUND33": "6.51",
        "F005": "27.56",
        "F008": "15.75",
        "F009": "33.32",
        "F010": "93.57",
        "F011": "65.74",
        "F012": "-3.74",
        "F014N_FUND33": "-5.46",
        "F015N_FUND33": "-3.74"
    },
    {
        "code": "016076",
        "typename": "混合型",
        "net": "0.9497",
        "name": "华夏智造升级混合C",
        "newnet": "0.9497",
        "newdate": "2025-02-20",
        "net1": "0.9417",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2022-11-18",
        "orgid": "00079099",
        "orgname": "华夏基金管理有限公司",
        "prerate": "0.85",
        "F003N_FUND33": "6.49",
        "F005": "27.48",
        "F008": "15.70",
        "F009": "33.14",
        "F010": "93.03",
        "F011": "64.76",
        "F012": "-5.03",
        "F014N_FUND33": "-6.58",
        "F015N_FUND33": "-5.03"
    },
    {
        "code": "160212",
        "typename": "混合型",
        "net": "3.3313",
        "name": "国泰估值优势混合(LOF)A",
        "newnet": "3.3313",
        "newdate": "2025-02-20",
        "net1": "3.3105",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2010-02-10",
        "orgid": "T000023592",
        "orgname": "国泰基金管理有限公司",
        "prerate": "0.63",
        "F003N_FUND33": "6.29",
        "F005": "30.28",
        "F008": "14.46",
        "F009": "23.30",
        "F010": "62.07",
        "F011": "51.95",
        "F012": "233.13",
        "F014N_FUND33": "8.13",
        "F015N_FUND33": "5.89"
    },
    {
        "code": "016616",
        "typename": "混合型",
        "net": "3.2806",
        "name": "国泰估值优势混合(LOF)C",
        "newnet": "3.2806",
        "newdate": "2025-02-20",
        "net1": "3.2602",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2022-09-09",
        "orgid": "T000023592",
        "orgname": "国泰基金管理有限公司",
        "prerate": "0.63",
        "F003N_FUND33": "6.28",
        "F005": "30.21",
        "F008": "14.42",
        "F009": "23.18",
        "F010": "61.76",
        "F011": "51.36",
        "F012": "-2.11",
        "F014N_FUND33": "6.39",
        "F015N_FUND33": "-2.11"
    },
    {
        "code": "015289",
        "typename": "混合型",
        "net": "1.3648",
        "name": "格林高股息优选混合A",
        "newnet": "1.3648",
        "newdate": "2025-02-20",
        "net1": "1.3454",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2022-11-15",
        "orgid": "T000669197",
        "orgname": "格林基金管理有限公司",
        "prerate": "1.44",
        "F003N_FUND33": "6.37",
        "F005": "21.85",
        "F008": "12.72",
        "F009": "28.02",
        "F010": "60.28",
        "F011": "64.28",
        "F012": "36.48",
        "F014N_FUND33": "33.52",
        "F015N_FUND33": "36.48"
    },
    {
        "code": "015290",
        "typename": "混合型",
        "net": "1.3532",
        "name": "格林高股息优选混合C",
        "newnet": "1.3532",
        "newdate": "2025-02-20",
        "net1": "1.3340",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2022-11-15",
        "orgid": "T000669197",
        "orgname": "格林基金管理有限公司",
        "prerate": "1.44",
        "F003N_FUND33": "6.36",
        "F005": "21.72",
        "F008": "12.63",
        "F009": "27.83",
        "F010": "59.86",
        "F011": "63.37",
        "F012": "35.32",
        "F014N_FUND33": "32.25",
        "F015N_FUND33": "35.32"
    },
    {
        "code": "009008",
        "typename": "混合型",
        "net": "1.4160",
        "name": "平安科技创新混合A",
        "newnet": "1.4160",
        "newdate": "2025-02-20",
        "net1": "1.4211",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2020-03-06",
        "orgid": "T000035604",
        "orgname": "平安基金管理有限公司",
        "prerate": "-0.36",
        "F003N_FUND33": "4.57",
        "F005": "16.87",
        "F008": "12.03",
        "F009": "22.72",
        "F010": "42.45",
        "F011": "34.78",
        "F012": "41.60",
        "F014N_FUND33": "2.65",
        "F015N_FUND33": "-14.51"
    },
    {
        "code": "004390",
        "typename": "混合型",
        "net": "2.8501",
        "name": "平安转型创新混合A",
        "newnet": "2.8501",
        "newdate": "2025-02-20",
        "net1": "2.8252",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2017-04-14",
        "orgid": "T000035604",
        "orgname": "平安基金管理有限公司",
        "prerate": "0.88",
        "F003N_FUND33": "5.73",
        "F005": "14.03",
        "F008": "10.49",
        "F009": "23.61",
        "F010": "32.54",
        "F011": "31.34",
        "F012": "210.30",
        "F014N_FUND33": "-6.87",
        "F015N_FUND33": "-14.53"
    },
    {
        "code": "001664",
        "typename": "混合型",
        "net": "1.4010",
        "name": "平安鑫安混合A",
        "newnet": "1.4010",
        "newdate": "2025-02-20",
        "net1": "1.3794",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2015-12-11",
        "orgid": "T000035604",
        "orgname": "平安基金管理有限公司",
        "prerate": "1.57",
        "F003N_FUND33": "4.20",
        "F005": "17.40",
        "F008": "10.47",
        "F009": "27.79",
        "F010": "31.59",
        "F011": "21.71",
        "F012": "40.10",
        "F014N_FUND33": "12.56",
        "F015N_FUND33": "10.12"
    },
    {
        "code": "007049",
        "typename": "混合型",
        "net": "1.3723",
        "name": "平安鑫安混合E",
        "newnet": "1.3723",
        "newdate": "2025-02-20",
        "net1": "1.3511",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2019-02-19",
        "orgid": "T000035604",
        "orgname": "平安基金管理有限公司",
        "prerate": "1.57",
        "F003N_FUND33": "4.20",
        "F005": "17.38",
        "F008": "10.46",
        "F009": "27.76",
        "F010": "31.52",
        "F011": "21.58",
        "F012": "33.27",
        "F014N_FUND33": "12.31",
        "F015N_FUND33": "9.78"
    },
    {
        "code": "001665",
        "typename": "混合型",
        "net": "1.3504",
        "name": "平安鑫安混合C",
        "newnet": "1.3504",
        "newdate": "2025-02-20",
        "net1": "1.3296",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2015-12-11",
        "orgid": "T000035604",
        "orgname": "平安基金管理有限公司",
        "prerate": "1.56",
        "F003N_FUND33": "4.19",
        "F005": "17.33",
        "F008": "10.44",
        "F009": "27.66",
        "F010": "31.32",
        "F011": "21.22",
        "F012": "35.04",
        "F014N_FUND33": "11.64",
        "F015N_FUND33": "8.79"
    },
    {
        "code": "004391",
        "typename": "混合型",
        "net": "2.7014",
        "name": "平安转型创新混合C",
        "newnet": "2.7014",
        "newdate": "2025-02-20",
        "net1": "2.6778",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2017-04-14",
        "orgid": "T000035604",
        "orgname": "平安基金管理有限公司",
        "prerate": "0.88",
        "F003N_FUND33": "5.72",
        "F005": "13.91",
        "F008": "10.41",
        "F009": "23.36",
        "F010": "32.00",
        "F011": "30.29",
        "F012": "192.84",
        "F014N_FUND33": "-8.35",
        "F015N_FUND33": "-16.57"
    },
    {
        "code": "700003",
        "typename": "混合型",
        "net": "5.1400",
        "name": "平安策略先锋混合",
        "newnet": "5.1400",
        "newdate": "2025-02-20",
        "net1": "5.1090",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2012-05-29",
        "orgid": "T000035604",
        "orgname": "平安基金管理有限公司",
        "prerate": "0.61",
        "F003N_FUND33": "5.28",
        "F005": "13.79",
        "F008": "10.37",
        "F009": "25.40",
        "F010": "33.89",
        "F011": "33.30",
        "F012": "462.40",
        "F014N_FUND33": "-4.73",
        "F015N_FUND33": "-11.93"
    },
    {
        "code": "014460",
        "typename": "混合型",
        "net": "0.7778",
        "name": "平安品质优选混合A",
        "newnet": "0.7778",
        "newdate": "2025-02-20",
        "net1": "0.7748",
        "shstat": "开放",
        "sgstat": "开放",
        "clrq": "2021-12-29",
        "orgid": "T000035604",
        "orgname": "平安基金管理有限公司",
        "prerate": "0.39",
        "F003N_FUND33": "5.08",
        "F005": "13.05",
        "F008": "9.58",
        "F009": "22.60",
        "F010": "30.83",
        "F011": "28.46",
        "F012": "-22.22",
        "F014N_FUND33": "-11.81",
        "F015N_FUND33": "-19.05"
    }
]
const fundType = ref('industry');
let originalData = ref([])
const tableData = reactive([]);
const loading = ref(false);

const handleTableChange = (pagination, filters, sorter) => {
    console.log(sorter)
    if (sorter.field) {
        let property = sorter.field
        tableData.sort((a, b) => {
            const aValue = parseFloat(a[property] || 0);
            const bValue = parseFloat(b[property] || 0);
            // 根据 order 决定升序或降序
            return sorter.order === 'ascend'
                ? aValue - bValue  // 升序
                : bValue - aValue; // 降序
        });
    }
};

const handleRadioChange = (value) => {
    // console.log('fundType:', fundType.value, value)
    // fundType.value = value

    if (fundType.value !== 'industry') {
        fetchData()
    }
}

let fundObj = { 'all': { url: '/fund/rank', type: 'fund' }, 'etf': { url: '/fund/etf', type: 'etf' }, 'industry': { url: '/fund/industry', type: 'industry' } }
// 获取数据并处理
// 修改 fetchData 中的数据处理
const fetchData = async () => {
    if (fundType.value === 'industry') {
        return
    }
    loading.value = true;
    try {
        console.log('fundType:', fundType.value, fundObj[fundType.value])
        const url = `${import.meta.env.VITE_API_URL}${fundObj[fundType.value].url}?date=${selectedDate.value}`;
        const response = await fetch(url);
        const result = await response.json();
        console.log('result:', url, result)

        // 数组转回对象：根据预定义的属性名顺序还原
        const setArray2Object = (arr) => {
            if (!Array.isArray(arr)) return {};
            const keys = [
                "code", "typename", "net", "name", "newnet",
                "newdate", "net1", "shstat", "sgstat", "clrq",
                "orgid", "orgname", "prerate", "F003N_FUND33",
                "F005", "F008", "F009", "F010", "F011", "F012",
                "F014N_FUND33", "F015N_FUND33"
            ];
            return Object.fromEntries(
                keys.map((key, index) => [key, arr[index]])
            );
        };


        // 转换数据格式
        let formattedData = result.map(arr => setArray2Object(arr));

        // 添加各个维度的排序索引
        const addSortIndexes = (data) => {
            const fields = ['F003N_FUND33', 'F008', 'F009', 'F010', 'F011'];
            fields.forEach(field => {
                const sortedArray = [...data].sort((a, b) =>
                    parseFloat(b[field] || 0) - parseFloat(a[field] || 0)
                );

                sortedArray.forEach((item, index) => {
                    const originalItem = data.find(i => i.code === item.code);
                    if (originalItem) {
                        originalItem[`${field}_index`] = index + 1;
                    }
                });
            });
            return data;
        };

        // 计算平均收益率并添加排名
        const addRanking = (data) => {
            // 计算平均收益率
            data.forEach(item => {
                let week = parseFloat(item.F003N_FUND33 || 0);
                let month = parseFloat(item.F008 || 0) - week;
                let month3 = parseFloat(item.F009 || 0) - (month + week);
                item.averageRate = (week * 1.5 + month / 4 * 1.2 + month3 / 12 * 1.1);
            });

            // 根据 averageRate 排序并添加排名
            const sortedArray = [...data].sort((a, b) =>
                b.averageRate - a.averageRate
            );

            sortedArray.forEach((item, index) => {
                const originalItem = data.find(i => i.code === item.code);
                if (originalItem) {

                    originalItem.ranking = index + 1;
                }
            });
            return data;
        };

        // 应用数据处理函数
        formattedData = addSortIndexes(formattedData);
        formattedData = addRanking(formattedData);

        // 更新表格数据
        originalData.value = formattedData;
        tableData.length = 0
        tableData.push(...formattedData);
    } catch (error) {
        console.error('Error fetching data:', error);
    } finally {
        loading.value = false;
    }
};

const dates = ref([])
const selectedDate = ref('')

const fetchDates = async () => {
    const url = `${import.meta.env.VITE_API_URL}/fund/dates`;
    const response = await fetch(url);
    const result = await response.json();
    dates.value = result.data
    selectedDate.value = dates.value.slice(-1)[0]
}

const handleDateChange = (date, checked) => {
    selectedDate.value = date
    console.log('selectedDate:', selectedDate.value)
    fetchData()
}

// 在初始化数据时调用
onMounted(() => {
    fetchDates().then(() => {
        fetchData()
    })
});

</script>

<style scoped>
.fund-table-container {
    padding: 24px;
}

:deep(.ant-table-title) {
    padding: 16px 24px;
    background: #fafafa;
    border-bottom: 1px solid #f0f0f0;
}

:deep(.ant-table-thead > tr > th) {
    background: #fafafa;
    font-weight: bold;
}

.fund-table-container {
    padding: 24px;
}

.radio-group-wrapper {
    display: flex;
    justify-content: center;
    align-items: center;
}

/* 如果需要额外的样式调整 */
:deep(.ant-radio-group) {
    text-align: center;
}
</style>